# P1> Find average PPN for each city

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel("/home/nineleaps/Python_training/data/Sales_Data/cleaned_data.xlsx")
df.head()

,ID,City,Location,PType,PPN,Nights,Beds,Baths,Reviews,Recent
0,IND137,Mumbai,Unknown,Entire Home/Apartment,3200,2.000000,1,1,4.000000,2022-03-12
1,IND138,Bangalore,Indiranagar,Private Room,1800,1.959184,1,1,2.000000,2023-02-15
2,IND139,Delhi,Hauz Khas,Entire Home/Apartment,4200,3.000000,2,2,3.853659,2021-12-25
3,IND140,Chennai,Teynampet,Shared Room,1000,1.000000,2,1,1.000000,2022-05-05
4,IND141,Hyderabad,Jubilee Hills,Entire Home/Apartment,3800,3.000000,3,3,5.000000,2022-08-20

### calculating avg PPN per city using pivot tables

In [12]:
avg_ppn_per_city = df.pivot_table(values="PPN", index="City", aggfunc="mean")
avg_ppn_per_city

                   PPN
City
Bangalore  4050.000000
Chennai    2587.500000
Delhi      2414.285714
Hyderabad  3633.333333
Kolkata    2216.666667
Mumbai     3966.666667
Pune       3133.333333